In [1]:
import pandas as pd 
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [2]:
import pandas as pd 
pd.Series([1,2,3,4,5],dtype='i4')

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [3]:
import pandas as pd 
minha_serie= pd.Series([1,2,3,4,5],dtype='i4',name="meus numeros",index=["um","dois","três","quatro","cinco"])
print(minha_serie["um"])
print(minha_serie["quatro"])
print(minha_serie["cinco"])

1
4
5

In [4]:
import pandas as pd 
minha_serie= pd.Series([1,2,3,4,5],dtype='i4',name="meus numeros",index=["um","dois","três","quatro","cinco"])
minha_serie['seis'] = 6
print(minha_serie)

um        1
dois      2
três      3
quatro    4
cinco     5
seis      6
Name: meus numeros, dtype: int32

In [5]:
import pandas as pd 
import numpy as np 
array = np.array([45,7,8,65.8,98.7])
pesos = pd.Series(array,index=["Carlos","Bia","Maria","Thamyres","Joao"])
print(pesos)
print(type(pesos))

Carlos      45.0
Bia          7.0
Maria        8.0
Thamyres    65.8
Joao        98.7
dtype: float64
<class 'pandas.core.series.Series'>

In [6]:
import pandas as pd 
data_frame = pd.DataFrame()
data_frame

Empty DataFrame
Columns: []
Index: []

In [7]:
import pandas as pd 
nomes =['Roger','Lucas','Renata','Maria']
data_frame = pd.DataFrame(nomes)
data_frame

        0
0   Roger
1   Lucas
2  Renata
3   Maria

In [8]:
print(data_frame)

        0
0   Roger
1   Lucas
2  Renata
3   Maria

In [9]:
import pandas as pd 
numeros = [
        ['11','22','33','44'],
        ['11','22','33','44'],
        ['11','22','33','44'],
        ['11','22','33','44']
]
data_frame = pd.DataFrame(numeros,columns=['a','b','c','d'])
data_frame

    a   b   c   d
0  11  22  33  44
1  11  22  33  44
2  11  22  33  44
3  11  22  33  44

In [10]:
import pandas as pd 
dados = {
    'Nome':['Roger','Cristiano','Diego','Carla'],
    'Idade':[45,55,30,25],
    'Profissão':['Engenheiro de dados','Analista BI','Analista de Dados','Cientista de Dados']

}
data_frame = pd.DataFrame(dados)
data_frame

        Nome  Idade            Profissão
0      Roger     45  Engenheiro de dados
1  Cristiano     55          Analista BI
2      Diego     30    Analista de Dados
3      Carla     25   Cientista de Dados

In [11]:
import pandas as pd 
dados = {
    'Idade':[45,55,30,25],
    'Profissão':['Engenheiro de dados','Analista BI','Analista de Dados','Cientista de Dados']

}
data_frame = pd.DataFrame(dados,index=['Roger','Cristiano','Diego','Carla'])
data_frame

           Idade            Profissão
Roger         45  Engenheiro de dados
Cristiano     55          Analista BI
Diego         30    Analista de Dados
Carla         25   Cientista de Dados

In [12]:
data_frame.loc['Roger']

Idade                         45
Profissão    Engenheiro de dados
Name: Roger, dtype: object

In [13]:
data_frame.loc['Carla']

Idade                        25
Profissão    Cientista de Dados
Name: Carla, dtype: object

In [14]:
import pandas as pd 
data = pd.read_csv('pessoas.csv',index_col='nome')
data

        id   profissao
nome
Maria    1  Professora
Joao     2      Medico
Ryan     3  Engenheiro
Robert   4    Advogado

In [15]:
len(data.columns)

2

In [16]:
data.columns

Index(['id', 'profissao'], dtype='object')

In [17]:
len(data.index)

4

In [18]:
data.index

Index(['Maria', 'Joao', 'Ryan', 'Robert'], dtype='object', name='nome')

In [19]:
data.shape

(4, 2)

In [20]:
for indice,linha in data.iterrows():
    print(indice,linha[0],linha[1])

Maria 1 Professora
Joao 2 Medico
Ryan 3 Engenheiro
Robert 4 Advogado

C:\Users\walla\AppData\Local\Temp\ipykernel_62796\3387270415.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(indice,linha[0],linha[1])

In [21]:
for coluna in data:
    print(data[coluna])

nome
Maria     1
Joao      2
Ryan      3
Robert    4
Name: id, dtype: int64
nome
Maria     Professora
Joao          Medico
Ryan      Engenheiro
Robert      Advogado
Name: profissao, dtype: object

In [22]:
data

        id   profissao
nome
Maria    1  Professora
Joao     2      Medico
Ryan     3  Engenheiro
Robert   4    Advogado

In [23]:
print(data.loc['Maria']['profissao'])

Professora

In [24]:
print(data.loc['Maria'])

id                    1
profissao    Professora
Name: Maria, dtype: object

In [25]:
print(data.iloc[0])

id                    1
profissao    Professora
Name: Maria, dtype: object

In [26]:
print(data.iloc[1])

id                2
profissao    Medico
Name: Joao, dtype: object

In [27]:
data.iloc[1:3]

      id   profissao
nome
Joao   2      Medico
Ryan   3  Engenheiro

In [28]:
print(data['profissao'])

nome
Maria     Professora
Joao          Medico
Ryan      Engenheiro
Robert      Advogado
Name: profissao, dtype: object

In [29]:
profissao = data['profissao']
print(profissao[0])

Professora

C:\Users\walla\AppData\Local\Temp\ipykernel_62796\3605541610.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(profissao[0])

In [30]:
data

        id   profissao
nome
Maria    1  Professora
Joao     2      Medico
Ryan     3  Engenheiro
Robert   4    Advogado

In [31]:
colunas = data.iloc[:,1:3]
colunas

         profissao
nome
Maria   Professora
Joao        Medico
Ryan    Engenheiro
Robert    Advogado

In [32]:
colunas = data.loc[:,"nome":"profissao"]
colunas

         profissao
nome
Maria   Professora
Joao        Medico
Ryan    Engenheiro
Robert    Advogado

In [33]:
data_adicional = pd.DataFrame({'Idade':[34,21,54],
                                'Profissao':['Paraquedista','Professor','Advogado'],
                                'Altura':[180.0,181.0,182.0]},
                                index=['Robert','Richard','Chad'])

data_adicional.index.name = 'Nones'
data_adicional

         Idade     Profissao  Altura
Nones
Robert      34  Paraquedista   180.0
Richard     21     Professor   181.0
Chad        54      Advogado   182.0

In [34]:
import pandas as pd 
df = pd.read_csv('pessoas.csv')
df

   id    nome   profissao
0   1   Maria  Professora
1   2    Joao      Medico
2   3    Ryan  Engenheiro
3   4  Robert    Advogado

In [35]:
pd.isnull(data_adicional)

         Idade  Profissao  Altura
Nones
Robert   False      False   False
Richard  False      False   False
Chad     False      False   False

In [36]:
data_adicional.notnull()

         Idade  Profissao  Altura
Nones
Robert    True       True    True
Richard   True       True    True
Chad      True       True    True

In [37]:
mask = pd.notnull(data_adicional['Idade'])
mask

Nones
Robert     True
Richard    True
Chad       True
Name: Idade, dtype: bool

In [38]:
data_adicional[mask]

         Idade     Profissao  Altura
Nones
Robert      34  Paraquedista   180.0
Richard     21     Professor   181.0
Chad        54      Advogado   182.0

In [39]:
copy = data_adicional.sort_values('Idade',ascending=True,inplace=False)
copy

         Idade     Profissao  Altura
Nones
Richard     21     Professor   181.0
Robert      34  Paraquedista   180.0
Chad        54      Advogado   182.0

In [40]:
copy = data_adicional.sort_values('Idade',ascending=True,inplace=False,na_position='first')
copy

         Idade     Profissao  Altura
Nones
Richard     21     Professor   181.0
Robert      34  Paraquedista   180.0
Chad        54      Advogado   182.0

In [41]:
data_adicional.loc['Chad','Idade'] = 34 
data_adicional

         Idade     Profissao  Altura
Nones
Robert      34  Paraquedista   180.0
Richard     21     Professor   181.0
Chad        34      Advogado   182.0

In [42]:
copy = data_adicional.sort_values(['Idade','Altura'],ascending=True,inplace=False,na_position='first')
copy

         Idade     Profissao  Altura
Nones
Richard     21     Professor   181.0
Robert      34  Paraquedista   180.0
Chad        34      Advogado   182.0

In [43]:
data_adicional.loc['Willian'] = (25,'Programador',1.88)
data_adicional.loc['Regis'] = (33,'Engenheiro de Dados',1.90)
data_adicional.loc['Fernando'] = (40,'Cientista de Dados',1.70)
data_adicional.loc['Roger'] = (35,'Analista de Dados',1.78)
data_adicional

          Idade            Profissao  Altura
Nones
Robert       34         Paraquedista  180.00
Richard      21            Professor  181.00
Chad         34             Advogado  182.00
Willian      25          Programador    1.88
Regis        33  Engenheiro de Dados    1.90
Fernando     40   Cientista de Dados    1.70
Roger        35    Analista de Dados    1.78

In [46]:
grupos = data_adicional.groupby('Profissao')

In [48]:
for indice in grupos:
    print(indice)
    print(grupos)

('Advogado',        Idade Profissao  Altura
Nones
Chad      34  Advogado   182.0)
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002BA47BF83D0>
('Analista de Dados',        Idade          Profissao  Altura
Nones
Roger     35  Analista de Dados    1.78)
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002BA47BF83D0>
('Cientista de Dados',           Idade           Profissao  Altura
Nones
Fernando     40  Cientista de Dados     1.7)
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002BA47BF83D0>
('Engenheiro de Dados',        Idade            Profissao  Altura
Nones
Regis     33  Engenheiro de Dados     1.9)
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002BA47BF83D0>
('Paraquedista',         Idade     Profissao  Altura
Nones
Robert     34  Paraquedista   180.0)
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002BA47BF83D0>
('Professor',          Idade  Profissao  Altura
Nones
Richard     21  Professor   181.0)
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002BA47BF83D0>
('Programador',          Idade    Profissao  Altura
Nones
Willian     25  Programador    1.88)
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002BA47BF83D0>

In [49]:
grupos.get_group('Programador')

         Idade    Profissao  Altura
Nones
Willian     25  Programador    1.88

In [50]:
grupo = data_adicional.groupby(['Profissao','Idade'])
grupos.describe()

                    Idade                                         Altura  \
                    count  mean std   min   25%   50%   75%   max  count
Profissao
Advogado              1.0  34.0 NaN  34.0  34.0  34.0  34.0  34.0    1.0
Analista de Dados     1.0  35.0 NaN  35.0  35.0  35.0  35.0  35.0    1.0
Cientista de Dados    1.0  40.0 NaN  40.0  40.0  40.0  40.0  40.0    1.0
Engenheiro de Dados   1.0  33.0 NaN  33.0  33.0  33.0  33.0  33.0    1.0
Paraquedista          1.0  34.0 NaN  34.0  34.0  34.0  34.0  34.0    1.0
Professor             1.0  21.0 NaN  21.0  21.0  21.0  21.0  21.0    1.0
Programador           1.0  25.0 NaN  25.0  25.0  25.0  25.0  25.0    1.0


                       mean std     min     25%     50%     75%     max
Profissao
Advogado             182.00 NaN  182.00  182.00  182.00  182.00  182.00
Analista de Dados      1.78 NaN    1.78    1.78    1.78    1.78    1.78
Cientista de Dados     1.70 NaN    1.70    1.70    1.70    1.70    1.70
Engenheiro de Dados    1.90 NaN    1.90    1.90    1.90    1.90    1.90
Paraquedista         180.00 NaN  180.00  180.00  180.00  180.00  180.00
Professor            181.00 NaN  181.00  181.00  181.00  181.00  181.00
Programador            1.88 NaN    1.88    1.88    1.88    1.88    1.88